* Pytest
  #+begin_src emacs-lisp
    ;; (use-package python-pytest
    ;;   :after python
    ;;   :custom
    ;;   (python-pytest-arguments
    ;;    '("--color"          ;; colored output in the buffer
    ;;      "--failed-first"   ;; run the previous failed tests first
    ;;      "--maxfail=5"))   ;; exit in 5 continuous failures in a run
    ;; )
    ;; (add-hook 'python-mode-hook
    ;;           (lambda ()
    ;;             (when-let ((r (locate-dominating-file default-directory ".pyroot")))
    ;;               (setq python-pytest-executable
    ;;                     (concat "PYTHONPATH=" r " " "pytest")))))
  #+end_src

  #+RESULTS:
  | (lambda nil (when-let ((r (locate-dominating-file default-directory .pyroot))) (setq python-pytest-executable (concat PYTHONPATH= r   pytest)))) | (lambda nil (let* ((r (and t (locate-dominating-file default-directory .pyroot)))) (if r (setq python-pytest-executable (concat PYTHONPATH= r   pytest)) nil))) | flyspell-prog-mode | enable-jedi | (lambda nil (add-to-list 'write-file-functions 'delete-trailing-whitespace)) | flycheck-mode |

